#+TITLE: emacs configuration
#+AUTHOR: Thomas
#+STARTUP: show3levels

**** init.el : mode : org-mode : ob-http

from: https://github.com/zweifisch/ob-http

#+begin_src emacs-lisp :tangle "init.el"
  (use-package ob-http
    :ensure t
    :defer t
    :after org
    :config
    ;; Add ob-http to the list of org-babel languages
    (org-babel-do-load-languages
     'org-babel-load-languages
     '(
       (emacs-lisp .t)
       (http . t)
       )))
#+end_src

Example (C-c C-c):
#+BEGIN_SRC http :pretty
GET http://httpbin.org/user-agent
User-Agent: ob-http
#+END_SRC

#+RESULTS:
: {
:   "user-agent": "ob-http"
: }

